/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : article-posting

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2020-10-13 14:45:38
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `articles`
-- ----------------------------
DROP TABLE IF EXISTS `articles`;
CREATE TABLE `articles` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `published_at` date NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `amount_viewer` bigint(20) NOT NULL,
  `video_link` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `category_id` bigint(20) unsigned NOT NULL,
  `user_id` bigint(20) unsigned NOT NULL,
  `status` varchar(2) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `articles_category_id_foreign` (`category_id`),
  KEY `articles_user_id_foreign` (`user_id`)
) ENGINE=MyISAM AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of articles
-- ----------------------------
INSERT INTO `articles` VALUES ('1', '2020-10-13', 'article-Ozil-ទទ-ល-ប-ន-ប-រ-ក-ល-ក-ទ-កច-ត-ត-ដល-ទ-៨-ល-ន-ផ-ន-ព-Arsenal-ទ-ម-ន-ប-ន-ល-ង', 'Ozil ទទួល​បាន​ប្រាក់​លើក​ទឹកចិត្ត​ដល់​ទៅ​​៨​លាន​ផោន​ពី Arsenal ទោះ​មិន​បាន​លេង', '<p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">Mesut Ozil ត្រូវ​បាន​រាយការណ៍​ថា ទទួល​បាន​ប្រាក់​​លើក​ទឹក​ចិត្ត​ដល់​ទៅ​៨​លាន​ផោន​ពី Arsenal កាល​ពី​ចុង​ខែ​មុន ត្បិត​​គេ​មិន​ដែល​បាន​លេង​ក៏​ដោយ។កីឡាករ​នាំ​លេង​យ៉ាង​សំខាន់​របស់​ជម្រើសជាតិ​អាល្លឺម៉ង់​គឺ​ជា​កីឡាករ​ដែល​មាន​ថ្លៃ​នឿយ​ហត់​ខ្ពស់​ជាង​គេ​នៅ​កាំភ្លើង​ធំ​៣៥​ម៉ឺនផោន​ក្នុង​មួយ​សប្ដាហ៍។ ប៉ុន្តែ​គេ​មិន​បាន​បង្ហាញ​ខ្លួន​ប្រកួត​ឲ្យ​ក្រុម​លោក Milek Arteta ចាប់​តាំង​ពី​ថ្ងៃ​ទី​៧ ខែ មីនា​។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ជា​ការ​ពិត​ ត្បិត Ozil មិន​​មាន​ឈ្មោះ​លេង​បាន​មួយ​ប្រកួត​ណា​សោះ​ក្នុង​រដូវ​កាល​នេះ ប៉ុន្តែ​តាម​រយៈ​លក្ខខណ្ឌ​​​ក្នុង​កុងត្រា​​ថ្មី​របស់​គេ​បាន​ចុះ​​ជាមួយ​ក្លឹប​កាល​ពី​ខែ មករា ឆ្នាំ ២០១៨ ​គឺ​​បាន​និយាយ​គ្នា​រឿង​ពិសេស​មួយ។ លក្ខខណ្ឌ​​​នោះ​គឺ Arsenal ត្រូវ​​ផ្ដល់​ជូន Ozil នូវ​ប្រាក់​៨​លាន​ផោន​ ដែល​ជា​ប្រាក់​លើក​ទឹក​ចិត្ត​សម្រាប់​ភាព​ស្មោះ​ត្រង់​ជាមួយ​ក្លឹប​ ដែល​គេ​អាច​បន្ត​នៅ​ជាមួយ​ក្លឹប​រហូត​ដល់​កុងត្រា​ឆ្នាំ​ចុងក្រោយ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">រដូវ​កាល​មុន Arsenal បាន​ព្យាយាម​បញ្ចេញ Ozil ឲ្យ​ចេញ​ឆ្ងាយ​ពី​ក្លឹប រហូត​ហ៊ាន​​ដាក់​សំណើ​១៨​លាន​ផោន​ដើម្បី​ញ្ចប់​កុងត្រា​របស់​គេ​នៅ​កីឡដ្ឋាន Emirates។ យ៉ាង​សំណើ​នេះ​ត្រូវ​បាន​ Ozil បដិសេធ ដោយ​បន្ត​​នៅ ទោះ​បី​មិន​បាន​លេង​ក្ដី៕</p>', '2', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:20:32', '2020-10-13 07:27:03', '2', '1', '1', null);
INSERT INTO `articles` VALUES ('2', '2020-10-13', 'article-ន-ស-រ-ព-ប-ន-ឱក-ស-ឡ-ង-សង-វ-ន-ONE-ជ-ថ-ម-ទ-ត-ហ-យ-ច-ង-ខ-ន-', 'នៅ​ ស្រីពៅ​ បាន​ឱកាស​ឡើង​សង្វៀន​ ONE​ ជា​ថ្មី​ទៀត​ហើយ​ចុង​ខែ​នេះ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">កីឡា​ការិនី​ដើម​កំណើត​ប្រដាល់​សកលកម្ពុជា​ នៅ​ ស្រីពៅ​ បាន​ឱកាស​បង្ហាញ​ខ្លួន​លើ​សង្វៀន​លំដាប់​ពិភពលោក​ ONE Championship​ ជា​ថ្មី​ទៀត​ហើយ​នៅ​ថ្ងៃ​ទី៣០​ ខែ​តុលា​ ឆ្នាំ​២០២០​ នេះ​នៅ​ប្រទេស​ សិង្ហបុរី។​</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នេះ​បើ​តាម​ការ​ផ្សព្វផ្សាយ​លើ​គេហទំព័រ​របស់​ ONE​ បាន​លើក​ឡើង​ថា​ កីឡា​ការិនី​របស់​កម្ពុជា​ នៅ​ ស្រីពៅ​ នឹង​តតាំង​ជា​មួយ​ជើង​ខ្លាំង​របស់​ប្រទេស​ឥណ្ឌា​ &nbsp;Ritu Phogat នា​ថ្ងៃ​ទី៣០​ ខែ​តុលា​ ឆ្នាំ​២០២០​ ដើម្បី​ស្វែង​រក​ជ័យជម្នះ​របស់​ខ្លួន​ជា​លើក​ទី២។​&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សិស្ស​គុន​មក​ពី​ក្លឹប​តាឡី​ដំរីមានរិទ្ធ​ខាង​លើ​នេះ​ នឹង​ក្លាយ​ជា​កីឡា​ការិនី​ទី១​ ដែល​អាច​ចេញ​ទៅ​ប្រកួត​លើ​សង្វៀន​ ONE​ អំឡុង​ផ្ទុះ​ជំងឺ​ COVID​ នេះ​ ព្រោះ​មិន​មាន​កីឡាករ​ កីឡា​ការិនី​រូប​ណា​បាន​ហោះ​ចេញ​ពី​ខ្មែរ​ទៅ​ប្រកួត​នៅ​សង្វៀន​ក្រៅ​ស្រុក​ឡើយ។​ នេះ​ក៏​ជា​សញ្ញាណ​ល្អ​មួយ​សម្រាប់​កីឡាករ​ផ្សេងៗ​ទៀត​ដែល​មាន​បំណង​ចង់​ចេញ​ទៅ​ប្រកួត​នៅ​កម្មវិធី​ប្រដាល់​ឯ​ក្រៅ​ប្រទេស​ផង​ដែរ។​&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ស្រីពៅ​ ធ្លាប់​ឡើង​សង្វៀន​ ONE​ បាន​២ដង​ ក្នុង​នោះ​លើក​ទី១​ ឈ្នះ​កីឡា​ការិនី​ថៃ​ Rika Ishige​ និង​លើក​ទី២​ ចាញ់​ពិន្ទុ​កីឡា​ការិនី​ឥណ្ឌូណេស៊ី​ Priscilla Hertati Lumban។​ ចំណែក​លើក​ទី៣​ ប៉ះ​កីឡា​ការិនី​ឥណ្ឌា​ Ritu Phogat​ នៅ​ថ្ងៃ​ទី៣០​ តុលា​ ២០២០​ នេះ​ចាំ​ នៅ​ ស្រីពៅ​ របស់​កម្ពុជា​អាច​រក​ជ័យជម្នះ​១ដង​ទៀត​បាន​ទេ៕​</span><br></p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:33:04', '2020-10-13 06:33:09', '2', '1', '1', null);
INSERT INTO `articles` VALUES ('3', '2020-10-13', 'article-វ-ដ-អ-បង-ហ-ញព-ជ-វ-តតស-របស-ម-ONE-Championship-ល-ក-Chatri-Sityodtong', 'វីដេអូ​បង្ហាញពី​ជីវិតតស៊ូ​​របស់មេ ONE Championship លោក Chatri Sityodtong', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">លោក Chatri Sityodtong ប្រធាន និងជានាយកប្រតិបត្តិ ONE Championship ត្រូវបានសារព័ត៌មាន​នានា​ក្នុងលោក​ចាប់​អារម្មណ៍​យ៉ាងខ្លាំង ដោយសារ​តែជីវិត​របស់​លោក​បានឆ្លងកាត់​ព្យុះភ្លៀងជាច្រើន ទម្រាំក្លាយជា​អ្នកជំនួញដ៏ជោគជ័យ​មួយរូប។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">លោកបាន​ហែលឆ្លងភាពក្រីក្រ នៅពេលគ្រួសារ​របស់​លោក​ត្រូវ​រង​ការ​វាយ​ប្រហារ​ពី​វិបត្តិសេដ្ឋកិច្ច​អាស៊ី​នៅក្នុង​ប្រទេស​ថៃ។ តាមរយៈ​ការ​តស៊ូ​ប្រឹងប្រែង​ធ្វើការ និង​ចំណង់​ក្នុង​វិស័យ​ក្បាច់​គុន យុវជន Sityodtong បាន​ប្រើការឈឺចាប់ ដើម្បី​ឈានឆ្ពោះទៅកាន់ភាពជោគជ័យ។ នៅទីបំផុត បុរស​កូនកាត់ថៃ-ជប៉ុន​រូបនេះ បាន​បង្កើត​ ONE Championship ដែលបាន​បង្រួបបង្រួម និងលើកស្ទួយ​ក្បាច់គុន​ និងកេរ្តិ៍តំណែលវប្បធម៌​ដ៏ថ្លៃថ្លា​ក្នុង​តំបន់អាស៊ី ដែលមាន​ប្រជាជន ៤ពាន់លាននាក់។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នៅក្នុងវីដេអូ​រឿងខ្លី ដែលមានចំណងជើងថា “The Chatri Sityodtong Story | Suffering, Sacrifice &amp; Success” លោក Sityodtong បាន​បង្ហាញ​ឲ្យអ្នកទស្សនា​បានឃើញពីជីវិតពីកុមារភាព​របស់​លោក ពីមូលហេតុដែលធ្វើឲ្យ​លោក​ឈាន​ជើង​ចូល​ហាត់​ប្រដាល់ថៃ ក៏ដូចជា​បង្ហាញពីជិវិត​តស៊ូ​រៀន​នៅ​សាកលវិទ្យាល័យ Harvard ដោយចាយ​លុយ​ត្រឹម ៤ដុល្លារ​ក្នុង​១ថ្ងៃ​លើ​ទឹកដីអាមេរិក។ នៅក្នុងវីដេអូនេះ ក៏មានការ​សម្ភាសន៍ម្ដាយ​របស់​លោក Sityodtong រួមទាំងមិត្តភក្ដិរបស់​លោក​មួយចំនួនផងដែរ។</p>', '2', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:37:09', '2020-10-13 07:30:13', '2', '1', '1', null);
INSERT INTO `articles` VALUES ('4', '2020-10-13', 'article--គ-រ-ណ-ប-យល-ថ-បច-ច-ប-បន-ន-ស-ម-ត-ល-អ-ជ-ង-គ-របស-កម-ព-ជ-គ-ម-ន-ព-រ-ន-ក-ន-', '​គ្រូ​ណាប់​ ​យល់​ថា បច្ចុប្បន្ន​​ស្មាត់​ល្អ​ជាង​គេ​របស់​កម្ពុជា​​គឺ​​មាន​ពីរ​នាក់​នេះ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">លោក សោម ចំណាប់ គ្រូ​បង្ហាត់​បាល់ទះ​ឆ្នេរខ្សាច់​ជម្រើស​ជាតិ​យល់​ឃើញ​​​ថា ស្មាត់​ពីរ​នាក់​នេះ​គឺ​ល្អ​ជាង​គេ​នៅ​កម្ពុជា​បច្ចុប្បន្ន ដែល​ម្នាក់​ល្អ​បាំង (រនាំង​ច្បាស់​) និង​ម្នាក់​ផ្ដាច់​ និង​សេវ៉ា​ច្បាស់​។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">​អតីត​កីឡាករ​ជម្រើស​ជាតិ​កម្ពុជា​ ដែល​ធ្លាប់​ចេញ​ទៅ​លេង​កម្មវិធី​ៗ​ធំ​ កាល​ឆ្នាំ​២០០៧-២០០៨ រូប​នេះ​បាន​​រៀបរាប់​ថា ​« សម្រាប់​ខ្ញុំ​ អ្នក​ដែល​ល្អ​ជាង​គេ​ពេល​​​នេះ​គឺ​ ជុក សោភា (ឌូក)។ ​ចំណុច​ល្អ​របស់​គេ​គឺ រឹង ផ្ដាច់​ល្អ​មិន​ងាយ​​ខូច​បាល់​ ( ឡាក ) មាន​សមត្ថភាព​វ៉ៃ​លើ​បាំង​ សឹង​គ្រប់​កីឡាករ​ក្នុង​ស្រុក​ខ្មែរ គេ​មាន​​ជំហរ​វ៉ៃ​លើ​ល្អ។ តួនាទី ២​ ​ដែល​​ជា​ចំណុច​ល្អ​របស់​ស្មាត់​មក​ពី​ខេត្ត​ព្រៃវែង​​រូប​នេះ​​គឺ វាយ​សេវា។ ​ចំណែក​​ម្នាក់​ទៀត​គឺ ​សុវណ្ណ​រាជ ដែល​ចំណុច​ល្អ​របស់​គេ​​គឺ ​ទះ​មិន​ខ្លាំង តែ​ច្បាស់ ចោះ​ល្អ។ ​គេ (រាជ) មាន​ជំនាញ​ល្អ​មួយ​ទៀត​គឺ​បាំង។ ការ​ធ្វើ​រនាំង​របស់​គេ មិន​ខ្ពស់​ទេ តែ​ចាប់​ល្អ​ »។</span><br></p><div class=\"content-grp-img\" style=\"margin-bottom: 20px; position: relative; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\"><picture class=\"lozad\" data-iesrc=\"https://media.sabay.com/media/sabay-news/Sport-News/Volleyball(2)/Volleyball(3)/5f48830f86379_1598587620.jpg\" data-alt=\"\" data-loaded=\"true\" style=\"display: block; min-height: 1rem;\"><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px;\">​​លោក​ពន្យល់​ទៀត​​ថា ក្រៅ​ពី ​រាជ, ​ម៉ាប់ ​ឆ្វេង ​ក៏​ល្អ​ដែរ ​ដែល​ស្មាត់​មក​​ពី​ខេត្ត​កំពត​រូប​នេះ​​ ​អាច​ចោះ​ល្អ ទាំង​ការ​វាយ​សេវា និង​ស្មាត់ ។ នេះ​គ្រាន់​ជា​ការ​យល់​ឃើញ ​ផ្ទាល់​ខ្លួន​​របស់​លោក​ប៉ុណ្ណោះ​ ប៉ុន្តែ​អ្នក​ដែល​ល្អៗ នៅ​មាន​ច្រើន​ទៀត ដូច​ជា​កីឡាករ​​របស់​​វិសាខា គួន ម៉ុម ​ជា​ដើម។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px;\">រំលឹក​ថា លោក សោម ចំណាប់ បច្ចុប្បន្ន​មាន​តួនាទី​ជា​គ្រូ​បង្វឹក​បាល់ទះ​ឆ្នេរខ្សាច់​ជម្រើស​ជាតិ​កម្ពុជា ផង និង​ជា​គ្រូ​បង្វឹក​ក្លឹប​បាល់ទះ​អគ្គស្នងការដ្ឋាន​រាជ​ធានី​ភ្នំពេញ ។ ​ជុក សោភា ហៅ ឌូក ធ្លាប់​ជា​កីឡាករ​ឆ្នើម​របស់​កម្ពុជា ចេញ​ទៅ​​​វ៉ៃ​ស៊ីហ្គេម​កាល​ពី​ឆ្នាំ​២០១៩ នៅ​ប្រទេស​ហ្វីលីពីន និង​​ជា​កីឡាករ​ឆ្នើម​របស់​ក្លឹប​កង​ពល​ធំ​អន្តរាគមន៍​លេខ ៣ ។ គេ​មាន​កម្ពស់ ១.៨៤ ម៉ែត្រ ជា​កីឡាករ​មក​ពី​ខេត្ត​ព្រៃវែង​ ។ បច្ចុប្បន្ន​ស្មាត់​ធំ​រូប​នេះ​កំពុង​មាន​បញ្ហា​របួស​សរសៃ​ជង្គង់​ខាង​ស្មាំ​។​រាជ ជា​ស្មាត់​ឆ្នើម​មួយ​រូប​របស់ បញ្ជា​ការដ្ឋាន​អង្គរក្ស ​ដែល​មាន​ជំនាញ​ក្នុង​ការ​ទះ​រក​ចន្លោះ​ គេ​ក៏​អាច​លើក​បាល់​បាន​យ៉ាង​ល្អ​ផង​ដែរ។ ស្មាត់​មក​ពី​ខេត្ត​កំពត​រូប​នេះ​មាន​កម្ពស់ ១,៧៨ ម៉ែត្រ​ ​ចូល​ហាត់​នៅ​ក្លឹប​បញ្ជា​ការដ្ឋាន​អង្គរក្ស​ឆ្នាំ​២០១៥ ​មាន​អាយុ ២៦ ឆ្នាំ​ គេ​មាន​​បង​ប្អូន​បង្កើត ៤ នាក់​ ក្នុង​នោះ​មាន​តែ​គេ​ និង​ប្អូន​ប្រុស​​ឈ្មោះ យុន ប៉ុណ្ណោះ​ ដែល​ចេះ​លេង​បាល់ ហើយ​​បច្ចុប្បន្ន​ក៏​ស្មាត់​ស្ដាំ​មួយ​រូប​របស់​អង្គរក្ស​ដែរ។ ​ជា​រឿង​សោកស្ដាយ​ដែល​ យុន ​ពេល​នេះ​​មាន​របួស​ ​បាន​នឹង​​កំពុង​​ព្យាបាល​របួស​ចង្កេះ ដែល​ត្រូវ​សម្រាក​រហូត​ដល់ ៦ ខែ​ ៕ ​​</p><source srcset=\"https://cdn.sabay.com/cdn/media.sabay.com/media/sabay-news/Sport-News/Volleyball(2)/Volleyball(3)/5f48830f86379_1598587620_large.jpg\" media=\"(min-width: 1920px)\"><source srcset=\"https://cdn.sabay.com/cdn/media.sabay.com/media/sabay-news/Sport-News/Volleyball(2)/Volleyball(3)/5f48830f86379_1598587620_medium.jpg\" media=\"(min-width: 980px)\"><source srcset=\"https://cdn.sabay.com/cdn/media.sabay.com/media/sabay-news/Sport-News/Volleyball(2)/Volleyball(3)/5f48830f86379_1598587620_small.jpg\" media=\"(min-width: 320px)\"></picture></div>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:42:41', '2020-10-13 06:42:49', '2', '2', '1', null);
INSERT INTO `articles` VALUES ('5', '2020-10-13', 'article-ប-ត-OnePlus-ច-កច-ញព-ក-រ-មហ-ន-ម-នក-រច-ប-ក-ណ-ត-OnePlus-8T', 'បិតា OnePlus ចាកចេញពីក្រុមហ៊ុន មុនការចាប់កំណើត OnePlus 8T', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សហស្ថាបនិក​ OnePlus លោក Carl Pei បាន​ចាក​ចេញ​ពី​ក្រុមហ៊ុន​ដើម្បី​បង្កើត​មុខ​ជំនួញ​ផ្ទាល់​ខ្លួន​មួយ​ផ្សេង​ទៀត។ នេះ​បើ​តាម​ការ​ចុះ​ផ្សាយ​របស់ TechCrunch ដែល​មាន​ការ​បញ្ជាក់​ពី​ប្រភព​ពីរ​ដែល​ដឹង​ច្បាស់​រឿង​នេះ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">OnePlus ត្រូវ​បាន​បង្កើត​ឡើង​ក្នុង​ខែ​ធ្នូ ឆ្នាំ ២០១៣ ដោយ​លោក Carl Pei និង Pete Lau ដែល​បច្ចុប្បន្ន​ជា​នាយក​ប្រតិបត្តិ​ក្រុមហ៊ុន។ ក្រុមហ៊ុន​ចិន​នេះ​ទទួល​បាន​កេរ្តិ៍​ឈ្មោះ​តាម​រយៈ​​យុទ្ធសាស្ត្រ​ទីផ្សារ​ផលិត​ស្មាតហ្វូន​តម្លៃ​ធូរ​ដែល​មាន​សមត្ថភាព​ខ្លាំង។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">លោក Pei បាន​ក្លាយ​ជា​អ្នក​តំណាង​ឲ្យ OnePlus សម្រាប់​ទីផ្សារ​លោក​ខាង​លិច និង​បាន​បង្ហាញ​ក្នុង​កម្មវិធី​ប្រកាស​ចេញ រួម​ទាំង​កម្មវិធី​ជួបជុំ​អ្នក​គាំទ្រ​ជា​ច្រើន​លើក​ផង​ដែរ ដោយ​សារ​ទេពកោសល្យ​ភាសា​អង់គ្លេស​​របស់​លោក។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ការ​ចាក​ចេញ​របស់​លោក Carl Pei នេះ​គឺ​​កើត​មាន​ឡើង​មុខ​ការ​ប្រកាស​ចេញ​ OnePlus 8T ដែល​នឹង​ត្រូវ​បង្ហាញ​ចេញ​នា​ថ្ងៃ​ស្អែក​នេះ៕</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:48:25', '2020-10-13 06:52:45', '3', '1', '1', null);
INSERT INTO `articles` VALUES ('6', '2020-10-13', 'article-ធន-គ-រន-ប-រទ-ស-អ-ហ-គង-ដ-ក-ព-ងម-នអ-នក-Hackល-ប-រព-ន-ធវ-រល-យ', 'ធនាគារនៅប្រទេស អ៊ូហ្គង់ដា កំពុងមានអ្នក Hackលើប្រព័ន្ធវេរលុយ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">កាលពីពេលថ្មីៗនេះក្រុមជនអនាមិកបានជ្រៀតចូលទៅក្នុងប្រព័ន្ធវេរលុយតាមរយៈទូរសព្ទរបស់ក្រុមហ៊ុន Pegasus Technologies ដែលជាក្រុមហ៊ុនគ្រប់គ្រងកម្មវិធីវេរលុយ និងសេវាកម្មហិរញ្ញវត្ថុផ្សេងៗទៀតឱ្យធនាគារធំៗនៅក្នុងប្រទេសអ៊ូហ្គង់ដា។ យ៉ាងហោចណាស់ទឹកប្រាក់ចំនួន ៣.២លានដុល្លារ ត្រូវបានលួចយកនៅក្នុងការវាយប្រហារនេះ ប៉ុន្តែចំនួនទឹកប្រាក់ពិតប្រាកដគឺអាចលើសពីនេះទៅទៀត។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">បច្ចុប្បន្នក្រុមហ៊ុនផ្ដល់សេវាកម្មទូរសព្ទធំៗពីរ MTN Uganda និង Airtel Uganda បានបិទដំណើរការវេរលុយនៅក្នុងប្រព័ន្ធរបស់ពួកគេដើម្បីស្រាវជ្រាវអំពីបញ្ហានេះ។ បើតាមអ្នកនាំពាក្យរបស់នាយកដ្ឋានស៊ើបអង្កេតព្រហ្មទណ្ឌ លោក Charles Twine បានឱ្យដឹងថា សមត្ថកិច្ចកំពុងតែធ្វើការស្រាវជ្រាវ ស្វែងរកក្រុមអ្នកវាយប្រហារ ចំនួនទឹកប្រាក់ដែលត្រូវបានលួច និងវិធីដែលពួកគេប្រើដើម្បីជ្រៀតចូលទៅក្នុងប្រព័ន្ធនេះផងដែរ។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សូមបញ្ជាក់ផងដែរថា សេវាកម្មហិរញ្ញវត្ថុតាមរយៈទូរសព្ទគឺមានភាពពេញនិយមនៅក្នុងប្រទេសអ៊ូហ្គង់ដា ដែលពួកគេប្រើសម្រាប់វេរលុយនៅពេលដែលទិញទំនិញផ្សេងៗ ឬដើម្បីបង់វិក័យប័ត្រទឹកនិងភ្លើងជាដើម មិនត្រឹមតែប៉ុណ្ណោះពួកគេក៏បានប្រើសេវាកម្មនេះដើម្បីខ្ចីប្រាក់បានថែមទៀតផង។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សម្រាប់ប្រទេសកម្ពុជាយើងវិញ សេវាកម្មវេរលុយតាមរយៈទូរសព្ទនេះក៏កំពុងតែមានភាពពេញ និយមខ្លាំងណាស់ដែរ ដូច្នេះដើម្បីការពារសុវត្ថិភាពក្នុងការប្រើប្រាស់សេវាកម្មនេះ នាយកដ្ឋានប្រឆាំងបទល្មើសបច្ចេកវិទ្យា សូមឱ្យអ្នកប្រើប្រាស់មានការប្រុងប្រយ័ត្ន ដូចជាការបោកប្រាស់លួងលោមតាមរយៈការផ្ញើសារឬតេចូលដោយអះអាងថា លោកអ្នកបានឈ្នះរង្វាន់ ប៉ុន្តែតម្រូវឱ្យបង់ប្រាក់សម្រាប់សេវាកម្មជាមុននោះ។ការបោកប្រាស់មួយទៀតនោះគឺជនខិលខូចបានតេចូលហើយថាពួកគេតេមកពីធនាគារ ដើម្បីបញ្ជាក់លេខគណនី ឬលេខកូដសម្រាប់ទទួលបានរង្វាន់ ប៉ុន្តែនេះគឺគ្រាន់តែជាការបោកបញ្ឆោតដើម្បីយកលេខកូដ ហើយចូលទៅក្នុងគណនីរបស់លោកអ្នក ដើម្បីលួចយកលុយរបស់លោកអ្នកតែប៉ុណ្ណោះ៕</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:49:47', '2020-10-13 06:52:58', '3', '2', '1', null);
INSERT INTO `articles` VALUES ('7', '2020-10-13', 'article-ម-នស-ម-តហ-វ-ន-Android-ថ-ម-ឡ-ងជ-ជ-ងឯកត-រ-ង-AnTuTu', 'មានស្មាតហ្វូន Android ថ្មី ឡើងជាជើងឯកតារាង AnTuTu', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iQOO 5 Pro និង iQOO 5 បាន​ក្លាយ​ជា​ជើង​ឯក​ថ្មី​នៃ​តារាង​ AnTuTu ប្រចាំ​ខែ​កញ្ញា​នៅ​ប្រទេស​ចិន ជា​មួយ​ពិន្ទុ​សរុប​ ៦៦៣៧៥២ និង ៦៦២ ១៦៥ ពិន្ទុ ដែល​បាន​ផ្ដួល​ Xiaomi Mi 10 Ultra ជើង​ឯក​​ខែ​មុន។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iQOO ទាំង​ពីរ​ម៉ូដែល​មាន​ដំណើរ​ការ​ដោយ​បន្ទះ​ឈីប Snapdragon 865 និង RAM ទំហំ ១២GB ប្រភេទ LPDDR5 ជា​មួយ​អង្គ​ផ្ទុក​ UFS 3.1 ដែល​មាន​ទំហំ ២៥៦GB។ ស្មាតហ្វូន​ទាំង​ពីរ​នេះ​មាន​កម្លាំង​ខ្លាំង​ជាង​ស្មាតហ្វូន​ប្រើ​ឈីប Snapdragon 865 ដទៃ​ត្រង់​ផ្នែក GPU និង​ដោយ​សារ​ការ​កែ​សម្រួល​លើ Software ពី​ក្រុម iQOO ផង​ដែរ។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ស្មាតហ្វូន​ផ្សេង​ទៀត​ដែល​មាន​ឈ្មោះ​ក្នុង​តារាង​ភាគ​ច្រើន​គឺ​ប្រើ​ប្រាស់​ឈីប Snapdragon 865 លើក​លែង​តែ​ Asus Zenfone 7 Pro និង ROG Black Shark 3S ប៉ុណ្ណោះ​ដែល​ប្រើ​ឈីប Snapdragon 865+ ហើយ​ស្មាតហ្វូន​ទាំង​អស់​ទទួល​បាន​ពិន្ទុ​សរុប​មិន​ក្រោម ៦០​ម៉ឺន​ពិន្ទុ​ឡើយ៕</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:50:46', '2020-10-13 06:52:53', '3', '2', '1', null);
INSERT INTO `articles` VALUES ('8', '2020-10-13', 'article-ទ-ងន-ជ-អ-វ-ដ-លគ-ដ-ងម-នអ-ព-iPhone-12-ដ-លន-ងប-រក-សច-ញយប-ន-', 'ទាំងនេះជាអ្វីដែលគេដឹងមុនអំពី iPhone 12 ដែលនឹងប្រកាសចេញយប់នេះ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone ជំនាន់​ថ្មី​នឹង​ប្រកាស​ចេញ​នា​យប់​ថ្ងៃ​ទី​១៣ ​រំលង​ចូល​ថ្ងៃ​ទី​១៤​ ខែ​តុលា​នេះ ​ដោយ​ការ​ប្រកាស​ចេញ​នា​ឆ្នាំ​នេះ​នឹង​រៀប​ចំ​​ឡើង​ជា​លក្ខណៈ​អនឡាញ​សុទ្ធ​មិន​មាន​ទស្សនិកជន​ចូល​រួម​ទស្សនា​ផ្ទាល់​នោះ​ឡើយ។ ត​ទៅ​នេះ​គឺ​ជា​ការ​បូក​សរុប​ដំណឹង​ច្បាស់​ការណ៍​ដែល​គេ​ដឹង​មុន​អំពី iPhone ជំនាន់​ថ្មី។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone ជំនាន់​ថ្មី​នឹង​មាន​ចំនួន​បួន​ម៉ូដែល​ឯណោះ ដែល​គេ​ជឿជាក់​ថា​វា​មាន​ឈ្មោះ iPhone 12 mini, iPhone 12, iPhone 12 Pro និង iPhone 12 Pro Max។ iPhone 12 mini និង iPhone 12 ជា​អ្នក​ស្នង​តំណែង iPhone 11 ខណៈ​ដែល iPhone 12 Pro និង iPhone 12 Pro Max ជា​អ្នក​ស្នង​តំណែង iPhone 11 Pro និង iPhone 11 Pro Max។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone ជំនាន់​ថ្មី​ទាំង​បួន​រំពឹង​ថា​មាន​ប្រើ​ប្រាស់​នូវ​រចនាបថ​គែម​រាង​ជ្រុង​​ដូច​ជា​ iPhone 4 និង iPad Pro ជំនាន់​ថ្មី​ដែរ។ iPhone 12 mini មាន​អេក្រង់​ទំហំ ៥,៤អ៊ីញ ហើយ iPhone 12 និង iPhone 12 Pro មាន​អេក្រង់​ទំហំ ៦,១អ៊ីញ។ ចំណែក iPhone 12 Pro Max មាន​អេក្រង់​ទំហំ ៦,៧អ៊ីញ ជា​អេក្រង់​ដែល​ធំ​បំផុត​​មិន​ធ្លាប់​មាន​លើ iPhone។ iPhone 12 ទាំង​អស់​នឹង​បំពាក់​នូវ​អេក្រង់​ប្រភេទ​ OLED ​ដូច​គ្នា ហើយ​អេក្រង់​មាន​ការពារ​ដោយ​កញ្ចក់​ថ្មី​ឈ្មោះ​ថា \"Ceramic Shield” ដែល​​មាន​ភាព​ធន់​ខ្លាំង​ជាង​មុន។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone 12 mini និង iPhone 12 នឹង​មាន​បំពាក់​កាមេរ៉ា​ក្រោយ​ពីរ​គ្រាប់ ដែល​មាន​គួប​ផ្សំ​ដោយ​កាមេរ៉ា​មេ​ប្រភេទ Wide និង​កាមេរ៉ា​មួយ​ទៀត​ជា​ប្រភេទ​ Ultrawide។ ចំណែក​ឯ​ iPhone 12 Pro និង iPhone 12 Pro Max មាន​កាមេរ៉ា​ក្រោយ​បី​គ្រាប់​ ជា​ប្រភេទ​កាមេរ៉ា​ Wide គួប​ផ្សំ​នឹង​កាមេរ៉ា Telephoto និង​កាមេរ៉ា Ultrawide រួម​ទាំង​មាន​នូវ​ Sensor LiDAR បន្ថែម​ពី​លើ​ផង​ដែរ។ កាមេរ៉ា Telephoto លើ​ប្រភេទ Pro មាន​សមត្ថភាព​អាច​ Zoom បាន​ឆ្ងាយ​ជាង​មុន​ ទាំង​សម្រាប់​ការ Zoom Optical និង Zoom Digital។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">​លើ​កាមេរ៉ា​នៃ iPhone 12 ទាំង​បួន​ក៏​នឹង​​មាន​មុខងារ Deep Fusion និង​មុខងារ Night Scene ​ដែល​មាន​សមត្ថភាព​ខ្លាំង​ជាង​មុន ​ហើយ​សម្រាប់​​មុខងារ​ Smart HDR ​ក៏​បាន​វិវត្តន៍​ដល់​ Smart HDR 3 ផង​ដែរ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone 12 ទាំង​បួន​នឹង​មាន​ដំណើរ​ការ​ដោយ​បន្ទះ​ឈីប​ A14 Bionic ទំហំ ៥​ណាណូ​ម៉ែត្រ ដែល​​មាន​សមត្ថភាព​ខ្លាំង​ជាង​មុន និង​សន្សំសំចៃ​ថាមពល​បាន​កាន់​តែ​ច្រើន​ ហើយ​មាន​គាំទ្រ​នូវ​សេវា 5G ជា​លើក​ដំបូង​ផង​ដែរ។ iPhone 12 mini និង iPhone 12 នឹង​មាន​ជម្រើស​អង្គ​ផ្ទុក​ទំហំ 64GB, 128GB និង 256GB។ ចំណែក iPhone 12 Pro និង iPhone 12 Pro Max មាន​ទំហំ​តូច​បំផុត​ចាប់​ពី 128GB ដល់ 512GB។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">iPhone 12 mini នឹង​មាន​តម្លៃ​ចាប់​ពី ៦៩៩​ដុល្លារ, iPhone 12 មាន​តម្លៃ​ចាប់​ពី ៧៩៩​ដុល្លារ, iPhone 12 Pro មាន​តម្លៃ​ចាប់​ពី ៩៩៩​ដុល្លារ ហើយ iPhone 12 Pro Max នឹង​មាន​តម្លៃ​ចាប់​ពី ១០៩៩​ដុល្លារ ជា​តម្លៃ​នៅ​ទីផ្សារ​សហរដ្ឋអាមេរិក។ iPhone 12 ទាំង​បួន​​រំពឹង​ថា​នឹង​ចេញ​លក់​ជា​បី​ដំណាក់​កាល ដោយ iPhone 12 និង iPhone 12 Pro ចេញ​លក់​មុន​គេ បន្ទាប់​មក​គឺ iPhone 12 mini និង​ចុង​ក្រោយ iPhone 12 Pro Max៕​​​</span><br></p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 06:52:40', '2020-10-13 06:52:49', '3', '1', '1', null);
INSERT INTO `articles` VALUES ('9', '2020-10-13', 'article-អស-ប-រម-ភ-មករ-នរប-បសង-គ-រ-បឋមទ-កក-រព-រខ-ល-ន-ក-ន-ងអ-ឡ-ងព-លភ-ល-ងល-ចទ-កប-បន-', 'អស់បារម្ភ! មករៀនរបៀបសង្គ្រោះបឋមទុកការពារខ្លួន ក្នុងអំឡុងពេលភ្លៀងលិចទឹកបែបនេះ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">យេីងសង្កេតឃេីញថាបច្ចុប្បន្ននេះមានភ្លៀងធ្លាក់ស្ទេីរតែរាល់ថ្ងៃ ដែលជាហេតុបង្កឲ្យ​មានគ្រោះទឹកជំនន់នៅតាមតំបន់មួយចំនួន ក៏ដូចជាបង្ក​ឲ្យ​​មាន​មនុស្ស​គ្រោះថ្នាក់ផងដែរ។ ដោយសារ​តែបែបនេះហើយ ទើប​សួនទឹកហ្កាឌិនសុីធីវ៉តធេីផាក បាន​​បង្កើត​នូវ​វគ្គបណ្តុះបណ្តាលពិសេសគីវគ្គ​សង្គ្រោះបឋម \"First Aid\" សម្រាប់បង្រៀនរបៀបជួយសង្គ្រោះផ្សេងៗ មិនថាពេលដើរលេង ឬក្នុងសហគមន៍ ជាពិសេស សម្រាប់​ក្រុមហ៊ុន ភោជនីយដ្ឋាន សាលារៀន សណ្ឋាគារ និងកន្លែងកម្សាន្តនានា គឺចាំបាច់ត្រវទទួលបាននូវវគ្គបណ្តុះបណ្តាល និងជំនាញឲ្យបានច្បាស់លាស់ ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">បន្ថែមពីនេះទៀត សួនទឹកហ្គាឌិនស៊ីធីវ៉តធើផាក បាន​បើកវគ្គបណ្តុះបណ្តាល ជំនាញជិះស្គីរលក \"Flow RiderClub\", ឆ្មាំអាងហែលទឹក \"Lifeguard\" និងថ្នាក់បង្រៀន​ហែល​ទឹក ការធ្វើចលនាសង្គ្រោះ CPR។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ព័ត៌មានបន្ថែម វគ្គបង្រៀនសង្គ្រោះបឋមពិសេស សម្រាប់ទុកគ្រាន់ជួយជីវិតក្រុមគ្រួសារមិត្តភក្តឬជីវិតមនុស្សនានា បានក្នុងគ្រាមានអាសន្ន ។</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:03:57', '2020-10-13 07:09:02', '1', '2', '1', null);
INSERT INTO `articles` VALUES ('10', '2020-10-13', 'article-គ-រអ-យសរស-រ-ជប-ន-ផ-តល-គ-រ-ងចក-រ-សម-រ-ប-ស-ងសង-ផ-ល-វ-ច-ន-ន-១៥គ-រ-ង-ដ-លជ-ជ-ន-យឥតស-ណង-មកកម-ព-ជ-', 'គួរអោយសរសើរ! ជប៉ុន ផ្តល់គ្រឿងចក្រ សម្រាប់សាងសង់ផ្លូវ ចំនួន ១៥គ្រឿង ដែលជាជំនួយឥតសំណង មកកម្ពុជា', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ជប៉ុនបានផ្ដល់ជំនួយឥតសំណងជាគ្រឿងចក្រចំនួន១៥គ្រឿង ក្នុងតម្លៃទឹកប្រាក់ ៥០០ លានយ៉េនជប៉ុន ស្មើនឹង ប្រមាណ ៤,៥ លានដុល្លារអាមេរិក តាមរយៈកម្មវិធីអភិវឌ្ឍន៍សេដ្ឋកិច្ច និងសង្គម។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នៅថ្ងៃទី១២ ខែតុលា ឆ្នាំ២០២០ ឯកឧត្តម ស៊ុន ចាន់ថុល ទេសរដ្ឋមន្រ្តី រដ្ឋមន្រ្តីក្រសួងសាធារណការ និងដឹកជញ្ជូន បានអញ្ជើញជាអធិបតីក្នុងពិធីប្រគល់-ទទួលគ្រឿងចក្រសាងសង់ ដែលជាជំនួយឥតសំណងរបស់ប្រទេសជប៉ុន តាមរយៈកម្មវិធីអភិវឌ្ឍន៍សេដ្ឋកិច្ច និងសង្គម ដោយមានការអញ្ជើញចូលរួមពីឯកឧត្តម MIKAMI Masahiro ឯកអគ្គរាជទូតជប៉ុនប្រចាំនៅកម្ពុជា លោក SUGANO Yuichi ប្រធានតំណាងទីភ្នាក់ងារសហប្រតិបត្តិការអន្តរជាតិជប៉ុន (JICA) ប្រចាំកម្ពុជា តំណាងក្រុមហ៊ុន Marubini Protechs (TBC) ឯកឧត្តម លោកជំទាវ ភ្ញៀវកិត្តិយសជាតិ និងអន្តរជាតិ ព្រមទាំងតំណាងស្ថាប័នពាក់ព័ន្ធផងដែរ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ថ្លែងទៅកាន់អង្គពិធីនាឱកាសនោះ ឯកឧត្តមទេសរដ្ឋមន្ត្រី បានវាយតម្លៃខ្ពស់ចំពោះប្រទេសជប៉ុនដែលបានផ្ដល់ជំនួយឥតសំណង ព្រមទាំងហិរញ្ញប្បទានដ៏ច្រើនសន្ធឹកសន្ធាប់សម្រាប់ការស្ដារ និងអភិវឌ្ឍហេដ្ឋារចនាសម្ព័ន្ធសំខាន់ៗ និងមានសក្ដានុពលជាច្រើន ក្នុងទិសដៅជំរុញកំណើនសេដ្ឋកិច្ច និងអភិវឌ្ឍកម្ពុជា។ ជំនួយសម្រាប់គម្រោងសាងសង់ហេដ្ឋារចនាសម្ព័ន្ធជាច្រើនរួមមាន៖ ផ្លូវជាតិ លេខ៦ ផ្លូវជាតិ លេខ៧ និងផ្លូវជាតិលេខ១ ប្រវែងសរុប ២៥៤,៣គីឡូម៉ែត្រ ប្រើប្រាស់ថវិកាប្រមាណ ១៨៩,១លានដុល្លារ អាមេរិក ស្ពានគីហ្សូណា និងស្ពានត្សឹបាសាប្រវែងសរុប ៣៥៧៥ ម៉ែត្រ ចំណាយថវិកាប្រមាណ១៨៦ លានដុល្លារអាមេរិក និងជួសជុលស្ពានជ្រោយចង្វារប្រវែងសរុប១០៨០ម៉ែត្រ ចំណាយថវិកាប្រមាណ ៣០ លានដុល្លារអាមេរិក។</span><br></p><div id=\"app-clip-content-oppowatch\" style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\"></div><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ជាមួយគ្នានោះផងដែរ ឯកឧត្តមទេសរដ្ឋមន្ត្រី បានសម្ដែងនូវអំណរគុណយ៉ាងជ្រាលជ្រៅតាមរយៈ ឯកឧត្តមឯកអគ្គរាជទូត MIKAMI Masahiro ជូនចំពោះប្រជាពលរដ្ឋ និងរាជរដ្ឋាភិបាលជប៉ុន ដែលជានិច្ចកាលបានជួយឧបត្ថម្ភគាំទ្រទាំងស្មារតី បច្ចេកទេស ឥណទានកម្ចីសម្បទាន និងជំនួយឥតសំណងជាបន្តបន្ទាប់សម្រាប់សាងសង់ ស្ដារ និងអភិវឌ្ឍហេដ្ឋារចនាសម្ព័ន្ធ ផ្លូវ-ស្ពាន និងកំពង់ផែអន្តរជាតិ សម្រាប់ជួយសម្រួលដល់ចរាចរណ៍ដឹកជញ្ជូនទំនិញទៅកាន់ទីផ្សារជាតិ និងអន្តរជាតិសំដៅរួមចំណែកជំរុញកំណើនសេដ្ឋកិច្ច អភិវឌ្ឍសង្គម និងកាត់បន្ថយភាពក្រីក្ររបស់ប្រជាជនកម្ពុជា។ គម្រោងផ្តល់ជំនួយនេះមានឈ្មោះថា ជំនួយឥតសំណងតាមរយៈកម្មវិធីអភិវឌ្ឍន៍សេដ្ឋកិច្ច និងសង្គម ផ្គត់ផ្គង់ដោយក្រុមហ៊ុនគ្រឿងចក្រ Marubini Protechs ក្នុងតម្លៃទឹកប្រាក់៥០០លានយ៉េនជប៉ុន ស្មើនឹងប្រមាណ៤,៥ លានដុល្លារអាមេរិក ដែលរួមមាន៖ គ្រឿងចក្រចំនួន១៥ គ្រឿងគឺ៖ Road Stabilizer &amp; Accessories (3 Units), Vibratory Single Drum Roller with CANOPY Stay (3 Units), Pneumatic Tire Roller (3 Units), Vibratory Tandem Roller (3 Units), Walk-behind Roller (3 Units), និង Spare Parts &amp; Consumables ផងដែរ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ការប្រើប្រាស់ម៉ាស៊ីន Stabilizer មានប្រយោជន៍យ៉ាងខ្លាំងក្នុងការកាត់បន្ថយ ចំណាយលើការថែទាំផ្លូវ បើប្រៀបធៀបនឹងមធ្យោបាយធម្មតា ពោលគឺចំណាយពេលខ្លីក្នុងប្រតិបត្តិការសាងសង់ពុំសូវមានការបំពុលបរិស្ថាន (ការហុយធូលីក្នុងពេលសាងសង់) ផ្លូវអាចប្រើប្រាស់បានយូអង្វែង បន្ទាប់ពីទទួលបានការពង្រឹងដោយប្រើម៉ាស៊ីន Stabilizer។ ឯកឧត្តមទេសរដ្ឋមន្ត្រី បានប្តេជ្ញានាំយកគ្រឿងចក្រទាំងនេះទៅប្រើប្រាស់ក្នុងគម្រោងសាងសង់ផ្លូវនានា ជាពិសេសគម្រោងសាងសង់ផ្លូវទាំង៣៨ខ្សែនៅក្រុងសៀមរាបដែលប្រមុខរាជរដ្ឋាភិបាលទើបតែបាន អនុម័តកាលពីពេលថ្មីៗកន្លងទៅនេះ ឱ្យសម្រេចបានជោគជ័យ និងមានប្រសិទ្ធភាពខ្ពស់ តាម គោលការណ៍ និងចក្ខុវិស័យក្នុងការសាងសង់ផ្លូវឱ្យបានជាប់ រឹងមាំ និងប្រើប្រាស់បានយូរអង្វែង។ លើសពីនេះទៀត ឯកឧត្តមទេសរដ្ឋមន្ត្រីបានឱ្យដឹងផងដែរថា បច្ចុប្បន្ននេះ ជប៉ុនកំពុងផ្ដល់ជំនួយឥត សំណងសម្រាប់គម្រោងសាងសង់ស្ពានឡើងវិញបន្ទាន់នៅតំបន់កំពុងប្រឈមនឹងទឹកជំនន់ដែលសាងសង់ស្ពានចំនួន ៧កន្លែងស្ថិតក្នុងខេត្តព្រៃវែង និងខេត្តក្រចេះ ចំណាយថវិកាប្រមាណ ៣៥លានដុល្លារ អាមេរិក និងផ្លូវជាតិលេខ៥ ប្រវែងសរុប ៣៦៦គីឡូម៉ែត្រ ក្នុងទំហំថវិកាប្រមាណ៥០០លានដុល្លារ អាមេរិកផងដែរ៕</p><div><br></div>', '1', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:05:39', '2020-10-13 07:31:14', '1', '2', '1', null);
INSERT INTO `articles` VALUES ('11', '2020-10-13', 'article-ប-រជ-ពលរដ-ឋ-ដ-លរងគ-រ-ដ-យជ-នន-ទ-កភ-ល-ង-ន-ខ-ត-តប-ត-ដ-បង-ក-ព-ងត-រ-វប-នជ-យសង-គ-រ-', 'ប្រជាពលរដ្ឋ ដែលរងគ្រោះដោយជំនន់ទឹកភ្លៀង នៅខេត្តបាត់ដំបង កំពុងត្រូវបានជួយសង្គ្រោះ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នាព្រឹកថ្ងៃទី១២ ខែតុលា ឆ្នាំ២០២០ កម្លាំងអន្តរាគមន៍របស់យោធភូមិភាគទី៥ បានបន្តចុះជួយសង្គ្រោះប្រជាពលរដ្ឋដែលរងគ្រោះដោយសារជំនន់ទឹកភ្លៀងនៅភូមិសូភី១ សូភី២ សូភី៣ ក្រុងបាត់ដំបង ខេត្តបាត់ដំបង ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">គិតត្រឹមព្រឹកនេះ ស្ថានភាពទឹកស្ទឹងសង្កែមានកម្ពស់ ១៤ម៉ែត្រ ក្នុងកម្រិតប្រកាសអាសន្នដដែល និងកម្ពស់ទឹកក្នុងភូមិទាំងបីខាងលើគឺ មានកម្រិត ១.២ម៉ែត្រទៅ ១.៥ម៉ែត្រ ហើយស្ថានភាពប្រជាពលរដ្ឋដែលរស់នៅតាមបណ្ដាភូមិសង្កាត់នៅតាមដងស្ទឹងសង្កែ កំពុងតែរងនូវជំនន់ទឹកភ្លៀងដែលហូរចេញពីដងស្ទឹងសង្កែចូលទៅជន់លិចតាមលំនៅដ្ឋានប្រជាពលរដ្ឋ ក្រុងបាត់ដំបង ។</span><br></p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:07:05', '2020-10-13 07:08:51', '1', '1', '1', null);
INSERT INTO `articles` VALUES ('12', '2020-10-13', 'article-ភ-លក-អត-ទ-ក-ដ-គ-ស-ទ-ធ-គ-រ-ស-គ-ច-ក-ឲ-យ-ភ-លក-Free-ន-ផ-ស-រ-ឡ-ក-គ-២២ទ-ត-ង-', 'ភ្លក់​អត់​? ទឹក​ដោះ​គោ​សុទ្ធ​គិរី​សួគ៌​ ចែក​ឲ្យ​ភ្លក់​ Free នៅ​​​​ផ្សារ​ឡាក់​គី​ ២២ទីតាំង​', '<p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ចាប់​ពី​ថ្ងៃ​ទី​ ៥ តុលា ដល់​ថ្ងៃ​ទី​ ២២​ វិច្ឆិកា ឆ្នាំ២០២០នេះ​ នឹង​មានកម្មវិធី​ភ្លក់​រស់ជាតិទឹកដោះគោសុទ្ធ​គិរីសួគ៌ ដោយ​ឥត​គិត​ថ្លៃ​ នៅ​តាម​ទី​តាំង​ទាំង​២២​ សាខា​ របស់​ផ្សារ​ទំនើប​ ឡាក់​គី​ ក្នុងរាជធានីភ្នំពេញ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ជាមួយ​នឹង​ការ​បង្កើត​កម្មវិធី​ភ្លក់​រសជាតិ​នៅ​ផ្សារទំនើបឡាក់គីនេះផងដែរ កសិដ្ឋាន​គិរីសួគ៌ ក៏បានថ្លែងអំណរគុណដែល​បងប្អូន​ ដែលបាន​ឆ្លើយតប​យ៉ាង​លើសលប់​អំឡុង​ពេល​ចេញ​លក់​សាកល្បង​នៃទឹកដោះគោសុទ្ធ​គិរីសួគ៌​នាពេល​កន្លងមក។ ក្រុមហ៊ុន​ពិតជា​មានសេចក្ដី​​រំភើប​ចំពោះ​គ្រប់​មតិ​យោបល់​ក្នុង​ន័យស្ថាបនា ក៏ដូចជា​ការ​ជម្រុញទឹកចិត្ត​ជា​ហូរហែ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ដោយសារតែការគាំទ្រ​ដ៏ច្រើនលើសលប់នេះផងដែរ ​កសិដ្ឋាន​នឹង​ឈាន​ទៅដល់​ផលិតកម្ម ១០០% នាពេលឆាប់ៗ ហើយ​នឹង​បន្ត​ចែកចាយ​ទឹកដោះគោសុទ្ធគិរីសួគ៌ ឲ្យ​ដល់​ក្បែរ​ផ្ទះ​លោកអ្នក​ក្នុង​ពេល​ដ៏ខ្លីខាងមុខ។ សម្រាប់​ចុង​សប្ដាហ៍នេះ អ្នក​អាចទៅ​ភ្លក់ទឹកដោះគោសុទ្ធគិរីសួគ៌ នៅ​ផ្សារទំនើប​ឡាក់គីព្រះសីហនុ ឡាក់គីសូរិយា និងឡាក់គី Rose Garden។ ចំណែក​ចាប់ពីសប្ដាហ៍​ក្រោយៗទៅ នៅរៀងរាល់ចុងសប្ដាហ៍ នឹងមានកម្មវិធីភ្លក់ទឹកដោះគោសុទ្ធគិរីសួគ៌​ នៅតាមផ្សារទំនើប​ឡាក់គីសាខាផ្សេងៗទៀតដូចគ្នា។ សម្រាប់​ព័ត៌មាន​បន្ថែមពីកម្មវិធីនេះ ប្រិយមិត្ត​អាចសាកសួរបាន តាមរយៈផេកហ្វេសប៊ុក&nbsp;<a href=\"https://www.facebook.com/kirisufarm\" target=\"_blank\" title=\"Opens in a new window\" style=\"background-color: rgb(255, 255, 255); color: rgb(48, 151, 209);\">Kirisu Farm</a>។នៅ​ក្នុង​ឱកាស​នោះ​ដែរ​ ក្រុមហ៊ុន​បាន​ចេញ​ប្រូម៉ូសិន​យ៉ាង​ពិសេស​ គឺ​រាល់​ការ​ទិញ​ទឹក​ដោះ​គោ​សុទ្ធ​គិរី​សួគ៌​ មិន​ថា​ចំណុះ​ ២​លីត្រ​ ឬ​ ៨៣០​មី​លី​លីត្រ​ នឹង​ទទួល​បាន​ការ​បន្ថែម​យ៉ាអួគិរីសួគ៌ ដោយ​ឥត​គិត​ថ្លៃ​។ គួរ​បញ្ជាក់​ផង​ដែរ​ថា​ ដើម្បី​រក្សា​គុណភាព​ទឹក​ដោះ​គោ​ស្រស់​ ឲ្យ​នៅ​មាន​រស​ជាតិ​ឆ្ងាញ់​ និង​មាន​ជី​វ​ជាតិ​ពេញ​លេញ​ អ្នក​គួរ​តែ​ទុក​ដាក់​ទឹក​ដោះ​គោ​ស្រស់​ឲ្យ​បាន​ត្រឹម​ត្រូវ​ ដូច​ជា​ ជ្រើស​រើស​ដប​ដែល​ត្រជាក់​បំផុត​នៅ​ពេល​ដែល​ទិញ​នៅ​ផ្សារ​ទំនើប​នានា​, មើល​ថ្ងៃ​ផុត​កំណត់​ឲ្យ​បាន​ត្រឹម​ត្រូវ​, យក​ដាក់​ចូល​ទូ​ទឹក​កក​ដែល​មាន​សីតុណ្ហភាព​ ៤​អង្សា​សេ​, ដាក់​ផ្នែក​ខាង​ក្រោម​នៃ​ទូ​ទឹក​កក​ កន្លែង​ដែល​ត្រជាក់​ជាង​គេ​ (តែ​មិន​មែន​ជា​កន្លែង​កក​ ឬ​ទ្វារ​ទូ​ទឹក​កក​) ភ្លាម​ពេល​មក​ដល់​ផ្ទះ​, និង​មិន​ត្រូវ​ទុក​ចោល​ក្រៅ​ទូ​ទឹក​កក​លើស​ពី​២​ម៉ោង​ទេ​។គួរ​ដឹង​ផង​ដែរ​ថា​ ទឹក​ដោះ​គោ​សុទ្ធ​ និង​យ៉ាអួ​គិរី​សួគ៌​ ផលិត​ចេញ​ពី​កសិដ្ឋាន​គិរី​សួគ៌​ ដែល​លាត​សន្ធឹង​លើ​ផ្ទៃ​ដី​ ៣០០​ហិច​តា​ នៅ​តំបន់​ភ្នំ​តា​ម៉ៅ​ ខេត្ត​តាកែវ​។ កសិដ្ឋាន​ បាន​នាំ​ចូល​ប្រភេទ​គោ​យក​ទឹក​ដោះ​ល្អ​បំផុត​ពី​ប្រទេស​អូស្រ្ដាលី​ និង​បាន​ប្រើ​ប្រាស់​បច្ចេក​ទេស​ទំនើប​ចុង​ក្រោយ​បំផុត​ រួម​នឹង​អ្នក​ជំនាញ​ពី​អ៊ីស្រាអែល​ ដែល​ជា​ប្រទេស​ជំនាញ​ខាង​ផលិត​ទឹក​ដោះ​គោ​ ដើម្បី​ធានា​បាន​នូវ​រស​ជាតិ​ គុណ​ភាព​ និង​ទំនុក​ចិត្ត​ពី​អ្នក​ទទួល​ទាន​។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">គិត​មកទល់ពេលនេះ ទឹកដោះគោសុទ្ធគិរីសួគ៌ មានលក់​នៅផ្សារម៉ាក្រូ, ផ្សារឡាក់គី, ផ្សារបាយ័នទួលគោក ផ្សារបាយ័ន​ ៧មករា ផ្សារបាយ័នជ្រោយចង្វារ, ផ្សារស៊ូភើស្ដ័រភ្នំពេញថ្មី, ផ្សារអរុណា, ផ្សារហ៊្វែផ្ល័ស (គ្រប់សាខា) និងផ្សារ NC។ ក្រុមហ៊ុននឹងបន្តពង្រីក​ការលក់​ជា​បន្ត​បន្ទាប់ទៀត។ ដើម្បីតាមដាន​រាល់​ព័ត៌មាន​ពីការលក់ ក៏ដូចជា​ព័ត៌មាន​ផ្សេងៗទៀតពី​កសិដ្ឋានគីរីសួគ៌ សូមចុច Like ទំព័រ​ហ្វេសប៊ុក Kirisu Farm&nbsp;<a href=\"https://www.facebook.com/kirisufarm\" target=\"_blank\" title=\"Opens in a new window\" style=\"color: rgb(48, 151, 209);\">តាមដំណរភ្ជាប់នេះ</a>៕</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:08:41', '2020-10-13 07:08:47', '1', '2', '1', null);
INSERT INTO `articles` VALUES ('13', '2020-10-13', 'article-ស-ល-តច-ត-ត-ក-រ-យព-ល-ឃ-ញ-រ-ប-រ-ង-របស-ស-យ-បន-ទ-ប-ព-រត-ឆ-លងក-ត-ប-ន-៤ខ-ត-', 'ស្លុតចិត្ត​ក្រោយពេល​ឃើញ​រូប​រាង​របស់​សាយ បន្ទាប់​ពី​រត់​ឆ្លងកាត់​បាន​៤ខេត្', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">អតីត​តារា​ចម្រៀង​លោក អួន បឋម ហៅ​សាយ បាន​រត់​ឆ្លងកាត់​ខេត្ត​ចំនួន​បួន​ហើយ គឺ​កណ្ដាល កំពង់​ស្ពឺ តាកែវ និង​ខេត្ត​កំពត។ នៅ​ថ្ងៃទី១៣ ខែ​តុលា នេះ សាយ នឹង​បន្ត​រត់​ចេញ​ពី​ស្រុក​កំពង់​ត្រាច ខេត្ត​កំពត ឆ្ពោះ​ទៅ​កាន់​ក្រុង​កែប ខេត្ត​កែប​បន្ត​ទៀត​ដោយ​ទឹកចិត្ត​មោះមុត ប៉ុន្តែ​រូបរាង​របស់​មើល​ទៅ​ខ្លោចចិត្ត។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នៅ​ក្នុង​វីដេអូ និង​រូប​ថត​ជា​ច្រើន​សន្លឹក​ជាមួយ​ក្រុម​យុវជន ព្រម​ទាំង​អាជ្ញាធរ​ខេត្ត​តាកែវ ដែល​លោក​បាន​បង្ហោះ​ថ្មីៗ​នេះ គេ​សង្កេត​ឃើញ​ថា សាយ​បាន​ប្ដូរ​សម្បុរ​ពី​សម្បុរ​សណ្ដែកបាយ ទៅ​ជា​ខ្មៅ​ស្រអាប់ ជាមួយ​នឹង​ភ្នែក​ខូង​ខ្មៅ សក់​បាស​ច្រូង ដោយសារ​រត់​ហត់ នៅ​ក្រោម​កម្ដៅ​ថ្ងៃ និង​ភ្លៀង​ជាង​១​សប្ដាហ៍។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សាយ៖\"</span><span style=\"font-weight: 700; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សម្រាប់​សុខភាព​អត់​អី​ទេ​បង តែ​រូប​កាយ​ផ្លាស់ប្ដូរ​ខ្ទេចខ្ទី​អស់​ហើយ ព្រោះ​ហត់ ក្ដៅ ភ្លៀង អត់​ដូច​យើង​ហាត់​រត់​នៅ​ក្លឹប​ទេ។ ពលរដ្ឋ​មិន​ទាន់​ឃើញ​ចូល​រួម​ផុលផុស​នៅ​ឡើយ តែ​ខ្ញុំ​នៅ​តែ​សប្បាយ​ចិត្ត​ក្នុង​ការ​រត់​ដើម្បី​បេសកកម្ម​មួយ​នេះ</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">\"។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">លោក អួន បឋម ហៅ​សាយ អាច​រាប់​បាន​ថា​ជា​យុវជន​ខ្មែរ​ដំបូង​គេ​ដែល​មាន​ទឹកចិត្ត​មនុស្សធម៌ និង​មោះមុត ក្នុង​ការ​រត់​ឆ្លងកាត់​ខេត្ត/ក្រុង​ចំនួន​២២ ដោយ​ប្រើ​ពេល​តែ​៩៩​ថ្ងៃ ដើម្បី​បំផុស​សកម្មភាព​មនុស្សធម៌ និង​រៃអង្គាស​ប្រាក់​ទៅ​ជួយ​ដល់​មន្ទីរ​ពេទ្យ​កុមារ​អង្គរ។ លោក​បាន​ចាប់​ផ្ដើម​រត់​កាល​ពី​ថ្ងៃទី៦ ខែ​តុលា ចំ​ថ្ងៃ​កំណើត​របស់​លោក​គម្រប់​អាយុ​៣០​ឆ្នាំ ដោយ​ចេញ​ពី​សាលា​ភូមិន្ទ​ភ្នំពេញ ឆ្ពោះ​ទៅ​ខេត្ត​កំពង់​ស្ពឺ និង​ខេត្ដ​បន្ដបន្ទាប់ ហើយ​ឥឡូវ​លោក​រត់​ជិត​ដល់​ខេត្ត​កែប​ហើយ។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ខេត្ដ/ក្រុង​ដែល​លោក​ត្រូវ​រត់​ឆ្លងកាត់​ទាំង​២២ រួម​មាន៖ ភ្នំពេញ កណ្ដាល កំពង់​ស្ពឺ តាកែវ កំពត កែប ព្រះសីហនុ កោះកុង ពោធិ៍សាត់ បាត់​ដំបង ប៉ៃលិន បន្ទាយ​មានជ័យ សៀមរាប ព្រះវិហារ រតនគិរី ស្ទឹងត្រែង មណ្ឌល​គិរី ក្រចេះ ត្បូង​ឃ្មុំ កំពង់​ចាម ស្វាយ​រៀង និង​ខេត្ត​ព្រៃវែង។</span><br></p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ចំពោះ​សប្បុរសជន ដែលចង់បរិច្ចាគ​ជាទឹកប្រាក់ អាច​បរិច្ចាគ​បានតាម​គណនី​ធនាគារ ​ABA : 000 320 555 (Angkor Hospital for Children Limited) ឬ Wing : 52714 (AHC Patient Contributions)។ សម្រាប់​ព័ត៌មាន​លម្អិត​ក្នុង​ការ​ចូល​រួម​ ក៏ដូចជាតាមដាន​ចំនួនទឹកប្រាក់ដែលបាន​បរិច្ចាគ សូម​ចូល​ទៅ​កាន់​គេហទំព័រ&nbsp;saicambodianartist.com/&nbsp;។ ក្រៅពីគេហទំព័រ​នេះ ប្រិយមិត្ត​អាច​តាមដាន​រាល់សកម្មភាពរបស់សាយអំឡុង​ពេលរត់ តាមរយៈ​ទំព័រហ្វេសប៊ុក​របស់ Sai, Channel YouTube របស់សាយ, ទំព័រហ្វេសប៊ុក​របស់ Sabay ក៏ដូចជាគេហទំព័រ Sabay។ សម្រាប់​ព័ត៌មាន​លម្អិត​ក្នុង​ការ​ចូល​រួម​ ក៏ដូចជាតាមដាន​ចំនួនទឹកប្រាក់ដែលបាន​បរិច្ចាគ សូម​ចូល​ទៅ​កាន់​គេហទំព័រ&nbsp;saicambodianartist.com/&nbsp;។ ក្រៅពីគេហទំព័រ​នេះ ប្រិយមិត្ត​អាច​តាមដាន​រាល់​សកម្មភាព​របស់​សាយ​អំឡុង​ពេល​រត់ តាមរយៈ​ទំព័រ​ហ្វេសប៊ុក​របស់ Sai, Channel YouTube របស់​សាយ, ទំព័រហ្វេសប៊ុក​របស់ Sabay ក៏ដូចជាគេហទំព័រ Sabay៕​</p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:15:43', '2020-10-13 07:21:47', '4', '2', '1', null);
INSERT INTO `articles` VALUES ('14', '2020-10-13', 'article-ត-រ-ចម-រ-ង-ជ-រម-ខ-របស-ផល-តកម-ម-រស-ម-ហង-សម-ស-ប-ដ-ង-ក-ព-ង-ខ-វល-ច-ត-ត-រ-ង-ដ-ច-គ-ន-ក-ន-ង-ព-ល-ត-ម-យ', 'តារា​ចម្រៀង​ជួរមុខ​របស់​ផលិតកម្ម​រស្មី​ហង្សមាស​បី​ដួង កំពុង​ខ្វល់​ចិត្ត​រឿង​ដូច​គ្នា​ក្នុង​ពេល​តែ​មួយ', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">តារា​ចម្រៀង​បី​ដួង គឺ​អ្នកនាង ឱក សុគន្ធ​កញ្ញា លោក ណុប បាយ៉ារិទ្ធ និង​លោក នី រតនា បាន​បញ្ចេញ​សារ​ស្រដៀង​គ្នា​ដល់​ប្រជា​ពលរដ្ឋ​ខ្មែរ​ទូទាំង​ប្រទេស​ឲ្យ​បង្កើន​ការ​ប្រុងប្រយ័ត្ន​ចំពោះ​សុខ​សុវត្ថិភាព​ពី​គ្រោះធម្មជាតិ​ទឹកជំនន់ ដោយ​បង្កប់​ពាក្យពេចន៍​ផ្ដាំផ្ញើ​ដ៏​គួរ​ឲ្យ​ចាប់​អារម្មណ៍​។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ឱក សុគន្ធ​កញ្ញា៖\"</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px; font-weight: 700;\">សូម​បួងសួង​ទេវតា​តាម​ថែរក្សា​ប្រជា​ជន​កម្ពុជា​ចៀស​ផុត​ពី​គ្រោះ​ធម្មជាតិ​នេះ​ឆាប់ៗ ហើយ​សូម​ឲ្យ​ពលរដ្ឋ​ខ្មែរ​មាន​សុវត្ថិភាព​គ្រប់ៗ​ក្រុម​គ្រួសារ</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">\"។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ចំណែក​លោក ណុប បាយ៉ារិទ្ធ អំពាវនាវ​ដល់​ប្រជា​ជន​ត្រូវ​បង្កើន​ការ​ប្រុងប្រយ័ត្ន ហើយ​រក​ទី​ទួល​សុវត្ថិភាព​ដើម្បី​ស្នាក់​នៅ​បណ្ដោះអាសន្ន និង​ថែរក្សា​សុខភាព​ឲ្យ​បាន​គ្រប់ៗគ្នា៖\"</span><span style=\"font-weight: 700; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សូម​ឲ្យ​ទឹក​ជំនន់​ស្រក​ចុះ​ឲ្យ​ឆាប់​រហ័ស ហើយ​សូម​កុំ​ឲ្យ​បន្ត​ជន់​លេច​ដល់​ខេត្ត​ក្រុង​ដទៃ​ទៀត ជា​ពិសេស​កុំ​ឲ្យ​ប៉ះពាល់​ដល់​អាយុ​ជីវិត​ពុក​ម៉ែ បង​ប្អូន កូន​ក្មួយ​ឲ្យ​សោះ</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">\"។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ងាក​មក​លោក នី រតនា វិញ។ លោក​បាន​អំពាវនាវ​ដល់​បង​ប្អូន​ប្រជា​ពលរដ្ឋ​ខ្មែរ​ដែល​កំពុង​រង​ផល​ប៉ះពាល់​ដោយ​គ្រោះ​ធម្មជាតិ​ទឹកជំនន់​ថា៖\"</span><span style=\"font-weight: 700; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">បង​ប្អូន​ត្រូវ​ថែរក្សា​សុខភាព​ទាំង​អស់​គ្នា ឥឡូវ​នេះ​ទឹក​ជំនន់​មិន​ទាន់​ស្រក​នៅ​ឡើយ​ទេ ខ្ញុំ​សូម​បួង​សួង​ទេវតា និង​វត្ថុ​សក្ដិសិទ្ធិ​ក្នុង​លោក​សូម​ឲ្យ​ប្រទេស​កម្ពុជា​យើង​ឆាប់​ផុត​ពី​គ្រោះ​ធម្មជាតិ​នេះ​ផង</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">\"។&nbsp;</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ស្ថានភាព​គ្រោះ​ធម្មជាតិ​ទឹកជំនន់​នៅ​កម្ពុជា បាន​ជន់​លេច​ខេត្ត​ក្រុង​មួយ​ចំនួន​ដូច​ជា៖ បាត់​ដំបង ពោធិ៍សាត់ និង​ស្រុក​មួយ​ចំនួន នៃ​ខេត្ត​ក្រុង​ដទៃ​ទៀត​ក៏​មាន​ការ​ជន់​លេច​ដែរ។ មន្ត្រី​ជំនាញ​ក្រសួង​ធនធាន​ទឹក ធ្លាប់​បង្ហើប​ថា កម្ពុជា​នឹង​បន្ត​រង​អាកាសធាតុ​សម្ពាធ​ទៀប ឬ​ព្យុះ​ចំនួន​ពីរ​ទៀត​ដោយ​ប្រយោល​ដែល​បញ្ហា​នេះ​នឹង​បង្ក​ឲ្យ​ប្រទេស​កម្ពុជា​បន្ត​មាន​ភ្លៀង​ធ្លាក់​រាយប៉ាយ ហើយ​ទឹក​ជំនន់​អាច​នឹង​បន្ត​កើន​ឡើង​ដែរ៕</span></p>', '0', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:17:46', '2020-10-13 07:21:43', '4', '1', '1', null);
INSERT INTO `articles` VALUES ('15', '2020-10-13', 'article-ថ-ល-ង-ធ-ៗ-ម-ន-ហង-សម-ស-ប-រម-ល-ត-រ-ល-ប-ៗ-ជ-ត-២០-រ-ប-មក-ច-រ-ង-រ-ម-គ-ន-ក-ន-ង-ចម-រ-ង-ត-១-បទ-គត-', 'ថា​លេង​ធំ​ៗ​មែន! ហង្សមាស ប្រមូល​តារា​ល្បី​ៗ​ជិត ២០​រូប មក​ច្រៀង​រួម​គ្នា​ក្នុង​ចម្រៀង​តែ​១​បទ​គត់!', '<p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ត្បិត​ថា មិន​បក​ស្រាយ​ដោយ​ផ្ទាល់​មាត់​ចំពោះ​ចចាមអារ៉ាម ប៉ុន្តែ​ហង្សមាស​បាន និង​កំពុង​ផ្ដល់​ចម្លើយ​ជុំវិញ​រឿង​នោះ តាម​ការ​ចេញ​បទ​ចម្រៀង​សម្រាប់​រដូវ​បុណ្យ​កឋិន ជាប់​គ្នា​រដឹក ដោយ​ឥឡូវ​នេះ​បាន​ប្រមូល​តារា​ល្បី​ៗ​របស់​ខ្លួន​ជិត ២០ មក​ច្រៀង​រួម​ក្នុង​បទ​ចម្រៀង​តែ​១​បទ​ប៉ុណ្ណោះ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">នេះ​ត្រូវ​បាន​គេ​កត់​សម្គាល់​ថា​ជា​បេសកកម្ម​ពិសេស​សម្រាប់​បម្រើ​អារម្មណ៍​ប្រិយមិត្ត​ក្នុង​រដូវ​បុណ្យ​កឋិន​ទាន​ឆ្នាំ2020 នេះ ដោយ​ក្នុង​នោះ ផលិតកម្ម​រស្មី​ហង្សមាស ទើប​បាន​បញ្ចេញ​វីដេអូ​ចម្រៀង​ពិសេស​មួយទៀត​ក្ដៅៗ។បទ​ចម្រៀង​ប្រពៃណី​ខ្មែរ​សម្រាប់​រដូវ​បុណ្យ​កឋិន​របស់ ​ផលិតកម្ម​ហង្សមាស ​នេះ​មាន​ចំណង​ជើង​ថា “កឋិន​សន្តិភាព’’ ច្រៀង​រួម​គ្នា​ដោយ​តារា​ចម្រៀង 16ដួង គឺ ណុប បាយ៉ារិទ្ធ - សុខ ស្រីនាង - នីកូ - សុខ សីឡាលីន - វង្ស តារារតនា - វី ឌីណែត - សំ សុវណ្ណារ៉ាក់ - លាង សុផាឡែន - សយ រតនៈ - ចម្រើន សុភ័ក្រ្ត - នួន សុធារ័ក្ស - ប៉ាច គីមមួយ - គង់ ចំរើន - កែវ សុបញ្ញា - ចាន់ កូម៉ែន - ឈីន រតនៈ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">វីដេអូ​ចម្រៀង ដែល​បាន​សាង​ភាព​ភ្ញាក់ផ្អើល​ទាំង​ព្រឹក​ថ្ងៃ​ដើម​សប្តាហ៍​នេះ បាន​អន្ទង​បេះដូង​ប្រិយ មិត្ត​អ្នក​ស្ដាប់ ឲ្យ​លង់​ជាមួយ​នឹង​មន្ត​នៃ​ដួង​ព្រលឹង​របស់​សិល្បៈ​វប្បធម៌​ខ្មែរ​ដែល​បាន​លេច​មក​យ៉ាង​ពិសេស​ក្នុង​វីដេអូ​ចម្រៀង​យ៉ាង​ល្អ​ឥត​ខ្ចោះ​នេះ។</p><p style=\"margin-right: 0px; margin-bottom: 15px; margin-left: 0px; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">មាន​ Comment ជាច្រើន​លើក​ឡើង​ចំ​ៗ​ថា នេះ​ទើប​សាក​សម​ជា​បទ​ចម្រៀង​ប្រពៃណី​ខ្មែរ​ ពិត​ជា​អរគុណ ដល់ ផលិតកម្ម​ហង្សមាស ដែល​បាន​ផលិត​បទ​ចម្រៀង​ត្រូវ​ចំ​ទំរង់ មិន​ក្លាយ មិន​ស្លុយ មាន​អត្ថន័យ​ល្អ ការ​ស្លៀកពាក់​សក្ដិសម​ឥត​ខ្ចោះ។ មិន​អស់​នៅ​ឡើយ មាន​ប្រិយមិត្ត​ខ្លះ​ទៀត អះអាង​ថា រូប​គេ​ពិត​ជា​លង់​នឹង​រស​ជាតិ​បទ​ភ្លេង ពិសេស​គឺ ស្តាប់​ហើយ​ជ្រះថ្លា នឹង​ចង់​ធ្វើបុណ្យ​ជា​ពិសេស​ចង់​ហែ​កឋិន​តែ​ម្ដង។<br></p>', '1', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:19:24', '2020-10-13 07:26:38', '4', '2', '1', null);
INSERT INTO `articles` VALUES ('16', '2020-10-13', 'article-Fan-ផ-អ-លថ-Jackson-ម-នស-ន-ហ-ល-ចល-ក-ត-ម-ច-ស-ខ-ល-នឆ-ល-យតបយ-ងផ-អ-មប-ផ-ត', 'Fan ផ្អើលថា Jackson មានស្នេហាលួចលាក់ តែម្ចាស់ខ្លួនឆ្លើយតបយ៉ាងផ្អែមបំផុត', '<p><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">តាមពិត​ទៅ​ ការ​ទាក់ទង​មាន​ស្នេហា​ក្នុង​វិស័យ​ K-Pop ចាត់​ទុក​ថា​ជាប្រធានបទ​ក្ដៅ​គគុក​គ្រប់​សម័យកាល តែ​ទោះ​ជា​យ៉ាង​សម្រាប់​ Jackson (ក្រុម GOT7) មិនសូវ​ជា​មាន​ការ​ព្រួយបារម្ភ​ខ្លាំង​ក្លាឡើយ។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">កាល​ពីពេល​កន្លង​ទៅ​ Jackson ក៏​ធ្លាប់​បាន​លើក​ឡើង​ដែរ​ថា តាមពិត​ទៅ​លោក​ក៏ចង់​ទាក់ទង​អ្នកណា​ម្នាក់​ដែរ ប៉ុន្តែ​រឿង​នេះ​មិន​មែន​ជា​រឿង​លេង​សើច​ទេ។ វា​មិន​មែន​ត្រឹម​តែ​ដើម្បី​សប្បាយ​ ប៉ុន្តែ​យើង​ក៏​ត្រូវ​មាន​ទំនួល​ខុសត្រូវ​ខ្ពស់​ដែរ។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ដោយឡែក​ បើ​ងាក​ទៅ​មើល​ Post មួយ​ដែលលោក​បាន​បង្ហោះ​កាល​ពីពេល​កន្លងទៅ​ ស្រាប់​តែ​គេ​ចាប់អារម្មណ៍​ ថា​មាន​អ្នក​គាំទ្រ​ម្នាក់​បាន​ Comment ពី​ការ​ព្រួយបារម្ភ​ចំពោះ Jackson ដែលត្រូវ​បាន​គេ​ចោទ​ថា​លួច​មាន​មិត្តស្រី​ស្ងាត់ៗ តែ​យ៉ាង​ណា​ពួកគេ​ក៏​នៅ​តែ​ចង់​ឲ្យ​ម្ចាស់ខ្លួន​បកស្រាយដែរ។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">Fan ម្នាក់​នោះ​បាន​សរសេរថា៖&nbsp;</span><span style=\"font-weight: 700; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">«កាលពី​យប់​ម្សិលមិញ ខ្ញុំ​ឃើញព័ត៌មាន​ថា​អ្នកមានសង្សារ​ហើយ​។ ខ្ញុំ​មិន​ដឹង​ថា​បកស្រាយ​ពី​អារម្មណ៍​យ៉ាងណា​ទេ...ណាមួយ​ថ្ងៃ​នេះ​ជា​ខួប​កំណើត​អាយុ​ ២០ឆ្នាំ​របស់ខ្ញុំទៀត ខ្ញុំ​ចង់​ឲ្យ​ខ្លួន​ឯង​មាន​អារម្មណ៍​សប្បាយ​ចិត្ត​ជាង​នេះ​បន្តិច ហើយ​ចង់​ប្រាប់​ថា​ខ្ញុំ​ចូលចិត្ត​អ្នក​ ៥ឆ្នាំ​ហើយ ខ្ញុំ​យល់​ពីអ្នក​ជាង​អ្នក​ណា​ទាំងអស់​ ទោះ​បី​មាន​រឿងអ្វី​ក៏ដោយ​ ក៏​ខ្ញុំនៅ​តែ​ជ្រើសយក​ការ​ទុកចិត្ត​ចំពោះ​អ្នក​ដាច់ខាត ព្រោះ​អ្នក​ជា​ Jackson Wang អ្នក​ដែលខ្ញុំ​ស្រឡាញ់ ៥ឆ្នាំ​មកហើយ អ្នក​បាន​និយាយ​ថា​ អ្នកនឹង​ប្រាប់ពួកយើង​បើ​អ្នក​មាន​មិត្តស្រី​ថ្ងៃ​ណាមួយ។ ពួកយើង​ជឿជាក់លើអ្នក»។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">ក្រោយ​ឃើញ​ Comment ដ៏​វែង​នេះ​ភ្លាម Jackson ក៏បាន​តប​ដោយ​សារ​កក់ក្ដៅ​ពោរពេញ​ដោយ​ក្ដី​ស្រឡាញ់ថា៖&nbsp;</span><span style=\"font-weight: 700; color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">«អ៊ីចឹង​ ឲ្យ​តែ​មាន​អ្នកណា​និយាយ​ រឿង​នោះ​ត្រូវ​តែពិត​មែនទេ? តើ​រវាងយើង ​មានការ​ទុក​ចិត្ត​គ្នាបន្តិចទេ? គ្មាន​ផ្លូវទេ! កុំ​គិត​ច្រើន​ ថ្ងៃ​នេះ​ជា​ថ្ងៃ​ខួប​កំណើត​របស់​អ្នក​ផង! រីករាយ​ថ្ងៃ​កំណើត»។</span><span style=\"color: rgb(34, 34, 34); font-family: Battambang, Arial, Helvetica, sans-serif; font-size: 14px;\">សារ​តប​នេះ​កាន់​តែ​ធ្វើ​ឲ្យ​អ្នក​គាំទ្រ​ស្រឡាញ់លោក​ថែម​មួយ​កម្រិត ព្រោះ​វា​បាន​បង្ហាញ​ពី​ទំនួល​ខុសត្រូវ​ខ្ពស់​ក្នុង​នាម​ជា​តារា​សំណព្វ​របស់មនុស្ស​ជា​ច្រើន។ មិន​ថា​មាន​រឿង​អ្វី​លោក​តែង​ប្រកាសប្រាប់អ្នក​គាំទ្រ​ជានិច្ច នេះ​ហើយ​ជា​ការ​ផ្សារ​ភ្ជាប់​ក្ដី​ស្រឡាញ់​កាន់​តែ​ជិតស្និទ្ធ​រវាង​លោក និង​អ្នក​គាំទ្រ៕</span><br></p>', '1', 'https://www.youtube.com/embed/UaaoBac2TTE', '2020-10-13 07:21:23', '2020-10-13 07:26:25', '4', '1', '1', null);

-- ----------------------------
-- Table structure for `article_photos`
-- ----------------------------
DROP TABLE IF EXISTS `article_photos`;
CREATE TABLE `article_photos` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `path` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `article_id` bigint(20) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `article_photos_article_id_foreign` (`article_id`)
) ENGINE=MyISAM AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of article_photos
-- ----------------------------
INSERT INTO `article_photos` VALUES ('1', 'default-imge', 'photo', '/images/uploads/file/20201013063304-photo_2019-11-02_11-35-22.jpg', '1', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);
INSERT INTO `article_photos` VALUES ('2', '/images/uploads/file/20201013063304-photo_2019-11-02_11-35-22.jpg', null, '/images/uploads/file/20201013063304-photo_2019-11-02_11-35-22.jpg', '2', null, null, null);
INSERT INTO `article_photos` VALUES ('3', '/images/uploads/file/20201013063709-photo_2019-11-02_11-36-04.jpg', null, '/images/uploads/file/20201013063709-photo_2019-11-02_11-36-04.jpg', '3', null, null, null);
INSERT INTO `article_photos` VALUES ('4', '/images/uploads/file/20201013064241-99344095_242480363873649_1642986756368236544_n.png', null, '/images/uploads/file/20201013064241-99344095_242480363873649_1642986756368236544_n.png', '4', null, null, null);
INSERT INTO `article_photos` VALUES ('5', '/images/uploads/file/20201013064825-5f8549c8a43f8_1602570660_medium.jpg', null, '/images/uploads/file/20201013064825-5f8549c8a43f8_1602570660_medium.jpg', '5', null, null, null);
INSERT INTO `article_photos` VALUES ('6', '/images/uploads/file/20201013064947-5f85179af1b09_1602557820_medium.jpg', null, '/images/uploads/file/20201013064947-5f85179af1b09_1602557820_medium.jpg', '6', null, null, null);
INSERT INTO `article_photos` VALUES ('7', '/images/uploads/file/20201013065046-5f85155a5511f_1602557220_medium.jpg', null, '/images/uploads/file/20201013065046-5f85155a5511f_1602557220_medium.jpg', '7', null, null, null);
INSERT INTO `article_photos` VALUES ('8', '/images/uploads/file/20201013065240-5f850959ebf44_1602554160_medium.jpg', null, '/images/uploads/file/20201013065240-5f850959ebf44_1602554160_medium.jpg', '8', null, null, null);
INSERT INTO `article_photos` VALUES ('9', '/images/uploads/file/20201013070357-5f8510eadc700_1602556080_medium.jpg', null, '/images/uploads/file/20201013070357-5f8510eadc700_1602556080_medium.jpg', '9', null, null, null);
INSERT INTO `article_photos` VALUES ('10', '/images/uploads/file/20201013070539-5f841e018b0f7_1602493920_medium.jpg', null, '/images/uploads/file/20201013070539-5f841e018b0f7_1602493920_medium.jpg', '10', null, null, null);
INSERT INTO `article_photos` VALUES ('11', '/images/uploads/file/20201013070705-5f83dffe435c6_1602478020_medium.jpg', null, '/images/uploads/file/20201013070705-5f83dffe435c6_1602478020_medium.jpg', '11', null, null, null);
INSERT INTO `article_photos` VALUES ('12', '/images/uploads/file/20201013070841-5f829f46b9ba1_1602395940_medium.jpg', null, '/images/uploads/file/20201013070841-5f829f46b9ba1_1602395940_medium.jpg', '12', null, null, null);
INSERT INTO `article_photos` VALUES ('13', '/images/uploads/file/20201013071543-5f853435cb283_1602565140_medium.jpg', null, '/images/uploads/file/20201013071543-5f853435cb283_1602565140_medium.jpg', '13', null, null, null);
INSERT INTO `article_photos` VALUES ('14', '/images/uploads/file/20201013071746-5f85134356666_1602556680_medium.png', null, '/images/uploads/file/20201013071746-5f85134356666_1602556680_medium.png', '14', null, null, null);
INSERT INTO `article_photos` VALUES ('15', '/images/uploads/file/20201013071924-5f8424fca66fe_1602495720_medium.jpg', null, '/images/uploads/file/20201013071924-5f8424fca66fe_1602495720_medium.jpg', '15', null, null, null);
INSERT INTO `article_photos` VALUES ('16', '/images/uploads/file/20201013072123-5f83b8f1db94e_1602468060_medium.jpg', null, '/images/uploads/file/20201013072123-5f83b8f1db94e_1602468060_medium.jpg', '16', null, null, null);

-- ----------------------------
-- Table structure for `categories`
-- ----------------------------
DROP TABLE IF EXISTS `categories`;
CREATE TABLE `categories` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `categories_slug_index` (`slug`(250))
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of categories
-- ----------------------------
INSERT INTO `categories` VALUES ('1', 'sport-new', 'Entertainment', 'Entertainment new!!!', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);
INSERT INTO `categories` VALUES ('2', 'sport-new', 'Sports', 'Sport new!!!', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);
INSERT INTO `categories` VALUES ('3', 'sport-new', 'Technology', 'Technology new!!!', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);
INSERT INTO `categories` VALUES ('4', 'sport-new', 'Social', 'Social new!!!', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);

-- ----------------------------
-- Table structure for `failed_jobs`
-- ----------------------------
DROP TABLE IF EXISTS `failed_jobs`;
CREATE TABLE `failed_jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of failed_jobs
-- ----------------------------

-- ----------------------------
-- Table structure for `migrations`
-- ----------------------------
DROP TABLE IF EXISTS `migrations`;
CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of migrations
-- ----------------------------
INSERT INTO `migrations` VALUES ('1', '2014_10_12_000000_create_users_table', '1');
INSERT INTO `migrations` VALUES ('2', '2014_10_12_100000_create_password_resets_table', '1');
INSERT INTO `migrations` VALUES ('3', '2016_06_01_000001_create_oauth_auth_codes_table', '1');
INSERT INTO `migrations` VALUES ('4', '2016_06_01_000002_create_oauth_access_tokens_table', '1');
INSERT INTO `migrations` VALUES ('5', '2016_06_01_000003_create_oauth_refresh_tokens_table', '1');
INSERT INTO `migrations` VALUES ('6', '2016_06_01_000004_create_oauth_clients_table', '1');
INSERT INTO `migrations` VALUES ('7', '2016_06_01_000005_create_oauth_personal_access_clients_table', '1');
INSERT INTO `migrations` VALUES ('8', '2019_08_19_000000_create_failed_jobs_table', '1');
INSERT INTO `migrations` VALUES ('9', '2020_06_23_061122_add_deleted_at_to_users_table', '1');
INSERT INTO `migrations` VALUES ('10', '2020_07_21_065149_create_categories_table', '1');
INSERT INTO `migrations` VALUES ('11', '2020_07_21_065328_create_articles_table', '1');
INSERT INTO `migrations` VALUES ('12', '2020_07_28_132630_change_field_type_to_articles_table', '1');
INSERT INTO `migrations` VALUES ('13', '2020_07_29_034807_create_article_photos_table', '1');
INSERT INTO `migrations` VALUES ('14', '2020_07_29_071501_create_roles_table', '1');
INSERT INTO `migrations` VALUES ('15', '2020_07_29_074828_add_field_role_id_to_users_table', '1');
INSERT INTO `migrations` VALUES ('16', '2020_08_02_032907_change_field_article_to_articles_table', '1');
INSERT INTO `migrations` VALUES ('17', '2020_10_03_023917_add_field_to_articles', '1');
INSERT INTO `migrations` VALUES ('18', '2020_10_03_052406_add_field_soft_delete_to_articles', '1');
INSERT INTO `migrations` VALUES ('19', '2020_10_05_040313_add_field_name_to_users', '1');

-- ----------------------------
-- Table structure for `oauth_access_tokens`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_access_tokens`;
CREATE TABLE `oauth_access_tokens` (
  `id` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) unsigned DEFAULT NULL,
  `client_id` bigint(20) unsigned NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `scopes` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `revoked` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `expires_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `oauth_access_tokens_user_id_index` (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of oauth_access_tokens
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_auth_codes`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_auth_codes`;
CREATE TABLE `oauth_auth_codes` (
  `id` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) unsigned NOT NULL,
  `client_id` bigint(20) unsigned NOT NULL,
  `scopes` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `revoked` tinyint(1) NOT NULL,
  `expires_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `oauth_auth_codes_user_id_index` (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of oauth_auth_codes
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_clients`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_clients`;
CREATE TABLE `oauth_clients` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) unsigned DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `secret` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `provider` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `redirect` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `personal_access_client` tinyint(1) NOT NULL,
  `password_client` tinyint(1) NOT NULL,
  `revoked` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `oauth_clients_user_id_index` (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of oauth_clients
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_personal_access_clients`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_personal_access_clients`;
CREATE TABLE `oauth_personal_access_clients` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `client_id` bigint(20) unsigned NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of oauth_personal_access_clients
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_refresh_tokens`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_refresh_tokens`;
CREATE TABLE `oauth_refresh_tokens` (
  `id` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `access_token_id` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `revoked` tinyint(1) NOT NULL,
  `expires_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `oauth_refresh_tokens_access_token_id_index` (`access_token_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of oauth_refresh_tokens
-- ----------------------------

-- ----------------------------
-- Table structure for `password_resets`
-- ----------------------------
DROP TABLE IF EXISTS `password_resets`;
CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`(250))
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of password_resets
-- ----------------------------

-- ----------------------------
-- Table structure for `roles`
-- ----------------------------
DROP TABLE IF EXISTS `roles`;
CREATE TABLE `roles` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `detail` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of roles
-- ----------------------------
INSERT INTO `roles` VALUES ('1', 'Super Admin', 'Super Admin Role', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);
INSERT INTO `roles` VALUES ('2', 'Admin', 'Admin Role', '2020-10-13 06:20:32', '2020-10-13 06:20:32', null);

-- ----------------------------
-- Table structure for `users`
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `f_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `l_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `role_id` bigint(20) unsigned DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`) USING HASH,
  KEY `users_role_id_foreign` (`role_id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1', 'Chan', 'Chea', 'superadmin@gmail.com', null, '$2y$10$arHc1fRreGHrW.qEnnl8re3PrJrd3srFIbrj5vgmmW0MTrXn8bpau', null, '2020-10-13 06:20:32', '2020-10-13 06:20:32', null, '1', null);
INSERT INTO `users` VALUES ('2', 'Devit', 'Chea', 'admin@gmail.com', null, '$2y$10$dTV.gajRccQjZFegD3uB8ODVSucj9hX5fQgQFDlyWGdYrMxXvP3Fm', null, '2020-10-13 06:20:32', '2020-10-13 06:20:32', null, '2', null);
